use movies;

/* 1. Напишете заявка, която извежда
адреса на студио ‘MGM’ */
select address from studio
where name = 'MGM'

/* 2. Напишете заявка, която извежда
рождената дата на актрисата Sandra
Bullock */
select birthdate from moviestar
where name = 'Sandra Bullock'

/*3. Напишете заявка, която извежда
имената на всички филмови звезди,
които са участвали във филм през
1980, в заглавието на които има
думата ‘Empire’ */
select starname from starsin
where movieyear = 1980 and movietitle like '%Empire%'

/*4. Напишете заявка, която извежда
имената на всички изпълнители на
филми с нетна стойност над
10 000 000 долара */
select name from MOVIEEXEC
where NETWORTH > 10000000

/*5. Напишете заявка, която извежда
имената на всички актьори, които са
мъже или живеят в Malibu */
select name from moviestar 
where gender = 'M' or address like '%Malibu%'


use pc

/*1. Напишете заявка, която извежда номер на модел, честота
на процесора (speed) и размер на диска (hd) за всички
компютри с цена, по-малка от 1200 долара. Задайте
псевдоними за атрибутите честота и размер на диска,
съответно MHz и GB */
select model, speed as 'MHz', hd as 'GB' from pc
where price < 1200

/*2. Напишете заявка, която извежда моделите и цените в евро
на всички лаптопи. Нека приемем, че в базата цените се
съхраняват в долари, а курсът е 1.1 долара за евро. Да се
изведат първо най-евтините лаптопи */
select model, (price / 1.1) as 'euro price' from laptop
order by 'euro price' asc

/* 3. Напишете заявка, която извежда номер на модел, размер
на паметта и размер на екран за тези лаптопи, чиято цена
е по-голяма от 1000 долара */
select model, ram, screen from laptop
where price > 1000

/* 4. Напишете заявка, която извежда всички цветни принтери */
 select * from printer
 where color = 'y'

 /* 5. Напишете заявка, която извежда номер на модел, честота
на процесора и размер на диска за тези компютри с DVD
12x или 16x и цена, по-малка от 2000 долара */
select model, speed, hd from pc 
where (cd = '12x' or cd = '16x') and price < 2000

/*6. Нека рейтингът на един лаптоп се определя по следната
формула: честота на процесора + размер на RAM паметта
+ 10*размер на екрана. Да се изведат кодовете, моделите и
рейтингите на всички лаптопи. Резултатът да бъде
подреден така, че първо да бъдат лаптопите с най-висок
рейтинг, а продукти с еднакъв рейтинг да бъдат подредени
по код */
select code, model, (speed + ram + 10*screen) as rating from laptop
order by rating desc, code

use ships 

/* 1. Напишете заявка, която извежда името на
класа и държавата за всички класове с брой
на оръдията, по-малък от 10 */
select class, country from classes 
where numguns < 10

/* 2. Напишете заявка, която извежда имената на
всички кораби, пуснати на вода преди 1918.
Задайте псевдоним на колоната shipName */
select name from ships 
where year(launched) < 1918

/*3. Напишете заявка, която извежда имената на
корабите, потънали в битка, и имената на
битките, в които са потънали */
select ship, battle from outcomes 
where result = 'sunk'

/*4. Напишете заявка, която извежда имената на
корабите с име, съвпадащо с името на
техния клас */
select name from ships where name = class

/*5. Напишете заявка, която извежда имената на
всички кораби, започващи с буквата R */
select name from ships where name like 'R%'

/*6. Напишете заявка, която извежда имената на
всички кораби, чието име е съставено от
точно две думи */
select name from ships
where name like '% %' and name not like '% % %'